In [86]:
import pandas as pd

In [87]:
info_vuelos = pd.read_csv('../csv/info_vuelos.csv')
#info_vuelos = info_vuelos.drop(columns=['vuelo', 'terminal_salida', 'puerta_salida', 'terminal_llegada', 'puerta_llegada'])
info_vuelos.head(10)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles
0,American,Allentown,Charlotte,2019-03-07T06:03,2019-03-07T08:58,175,577,0
1,American,Allentown,Charlotte,2019-03-07T11:26,2019-03-07T13:31,125,577,2
2,American,Allentown,Charlotte,2019-03-07T18:43,2019-03-07T20:55,132,577,1
3,American,Allentown,Charlotte,2019-03-08T06:07,2019-03-08T08:31,144,577,2
4,American,Allentown,Charlotte,2019-03-08T11:37,2019-03-08T13:44,127,577,1
5,American,Allentown,Charlotte,2019-03-08T18:50,2019-03-08T21:00,130,577,3
6,American,Allentown,Charlotte,2019-03-09T06:12,2019-03-09T08:24,132,577,0
7,American,Allentown,Charlotte,2019-03-09T11:37,2019-03-09T13:44,127,577,3
8,American,Allentown,Charlotte,2019-03-09T18:50,2019-03-09T21:00,130,577,1
9,American,Allentown,Charlotte,2019-03-10T06:12,2019-03-10T08:24,132,577,3

### Me quedo con los vuelos diferentes

In [88]:
"Cantidad de vuelos diferentes: {}".format(len(info_vuelos.groupby(by=['origen', 'destino'])))

'Cantidad de vuelos diferentes: 3655'

In [40]:
for index, group in info_vuelos.groupby(by=['origen', 'destino']):
    display(group.head(1))
    break

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles
103786,British Airways,Aalborg,Aarhus,2019-03-11T17:37,2019-03-11T19:15,98,559,2

In [41]:
nuevo_dataframe = info_vuelos.groupby(by=['origen', 'destino']).head(5).reset_index(drop=True)

In [42]:
nuevo_dataframe.sample(6)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles
7185,Air China,Chongqing,Guilin,2019-03-12T11:25,2019-03-12T14:40,195,792,1
4919,Alaska,Juneau,Yakutat,2019-03-12T14:10,2019-03-12T16:15,125,673,0
7533,Air China,Hangzhou,Xi'an,2019-03-12T21:14,2019-03-12T23:28,134,989,1
79,American,Birmingham,Miami,2019-03-07T06:21,2019-03-07T09:39,198,713,2
1833,Air Canada,Kahului,Vancouver,2019-03-08T01:04,2019-03-08T08:37,453,1175,1
11970,TAAG,Menongue,Luanda,2019-03-13T19:45,2019-03-13T21:05,80,614,2

### Actualizo la fecha de los vuelos

In [44]:
nuevo_dataframe.loc[0]['hora_salida']

'2019-03-07T06:03'

In [45]:
import datetime

In [84]:
date_time_str = nuevo_dataframe.loc[0]['hora_salida']
date_time_obj = datetime.datetime.strptime(date_time_str, "%Y-%m-%dT%H:%M")
date_time_obj

datetime.datetime(2019, 6, 9, 6, 3)

In [83]:
date_time_str = nuevo_dataframe.loc[0]['hora_salida']
date_time_obj = datetime.datetime.strptime(date_time_str, "%Y-%m-%dT%H:%M")
date_time_obj = date_time_obj.replace(year=2040)
date_time_obj.strftime("%Y-%m-%dT%H:%M")

'2040-06-09T06:03'

In [57]:
datetime.datetime.now()

2019

In [75]:
def change_days(salida, llegada):
    now = datetime.datetime.now()
    date_time_salida = datetime.datetime.strptime(salida, "%Y-%m-%dT%H:%M")
    date_time_llegada = datetime.datetime.strptime(llegada, "%Y-%m-%dT%H:%M")
    diferencia_dias = date_time_llegada.day - date_time_salida.day
    if(diferencia_dias > 0):
        date_time_llegada = date_time_llegada.replace(day=(now.day + diferencia_dias))
    else:
        date_time_llegada = date_time_llegada.replace(day=now.day)
    date_time_llegada = date_time_llegada.replace(month=now.month)
    date_time_salida = date_time_salida.replace(month=now.month)
    date_time_salida = date_time_salida.replace(day=now.day)
    return pd.Series([date_time_salida.strftime("%Y-%m-%dT%H:%M"), date_time_llegada.strftime("%Y-%m-%dT%H:%M")])

In [76]:
salida = nuevo_dataframe.loc[0]['hora_salida']
print(salida)
llegada = nuevo_dataframe.loc[0]['hora_llegada']
llegada = '2019-03-08T08:58'
print(llegada)

2019-03-07T06:03
2019-03-08T08:58

In [77]:
change_days(salida, llegada)

0    2019-06-09T06:03
1    2019-06-10T08:58
dtype: object

In [79]:
nuevo_dataframe[['hora_salida', 'hora_llegada']] = nuevo_dataframe[['hora_salida', 'hora_llegada']].apply(lambda x: change_days(x.hora_salida, x.hora_llegada), axis=1)

In [85]:
nuevo_dataframe.head(3)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles,days_flying
0,American,Allentown,Charlotte,2019-06-09T06:03,2019-06-09T08:58,175,577,0,False
1,American,Allentown,Charlotte,2019-06-09T11:26,2019-06-09T13:31,125,577,2,False
2,American,Allentown,Charlotte,2019-06-09T18:43,2019-06-09T20:55,132,577,1,False

### Genero nuevos dataframes aumentando la fecha

In [89]:
otro_dataframe = nuevo_dataframe.copy()

In [90]:
otro_dataframe.head(2)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles,days_flying
0,American,Allentown,Charlotte,2019-06-09T06:03,2019-06-09T08:58,175,577,0,False
1,American,Allentown,Charlotte,2019-06-09T11:26,2019-06-09T13:31,125,577,2,False

In [97]:
def sum_day(salida, llegada):
    date_time_salida = datetime.datetime.strptime(salida, "%Y-%m-%dT%H:%M")
    date_time_llegada = datetime.datetime.strptime(llegada, "%Y-%m-%dT%H:%M")
    
    date_time_salida = date_time_salida.replace(day = date_time_salida.day + 1)
    date_time_llegada = date_time_llegada.replace(day = date_time_llegada.day + 1)
    
    return pd.Series([date_time_salida.strftime("%Y-%m-%dT%H:%M"), date_time_llegada.strftime("%Y-%m-%dT%H:%M")])

In [98]:
salida = nuevo_dataframe.loc[0]['hora_salida']
print(salida)
llegada = nuevo_dataframe.loc[0]['hora_llegada']
llegada = '2019-03-08T08:58'
print(llegada)

2019-06-09T06:03
2019-03-08T08:58

In [99]:
sum_day(salida, llegada)

0    2019-06-10T06:03
1    2019-03-09T08:58
dtype: object

In [100]:
otro_dataframe[['hora_salida', 'hora_llegada']] = otro_dataframe[['hora_salida', 'hora_llegada']].apply(lambda x: sum_day(x.hora_salida, x.hora_llegada), axis=1)

In [102]:
#Entonces quedan asi los dataframes
nuevo_dataframe.head(2)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles,days_flying
0,American,Allentown,Charlotte,2019-06-09T06:03,2019-06-09T08:58,175,577,0,False
1,American,Allentown,Charlotte,2019-06-09T11:26,2019-06-09T13:31,125,577,2,False

In [101]:
otro_dataframe.head(2)

,aerolinea,origen,destino,hora_salida,hora_llegada,duracion,precio,asientos_disponibles,days_flying
0,American,Allentown,Charlotte,2019-06-10T06:03,2019-06-10T08:58,175,577,0,False
1,American,Allentown,Charlotte,2019-06-10T11:26,2019-06-10T13:31,125,577,2,False

### Iteracion de 10 dias y concateno todos los dataframes

In [ ]:
otro_dataframe = nuevo_dataframe.copy()
dataframe_final = nuevo_dataframe.copy()
for x in range(10):
    otro_dataframe[['hora_salida', 'hora_llegada']] = otro_dataframe[['hora_salida', 'hora_llegada']].apply(lambda x: sum_day(x.hora_salida, x.hora_llegada), axis=1)
    dataframe_final = pd.concat([dataframe_final, otro_dataframe]).reset_index(drop=True)
    print(len(otro_dataframe))
    print(len(dataframe_final))
    print("+++++++++++++++++")

16544
33088
+++++++++++++++++
16544
49632
+++++++++++++++++
16544
66176
+++++++++++++++++
16544
82720
+++++++++++++++++
16544
99264
+++++++++++++++++
16544
115808
+++++++++++++++++
16544
132352
+++++++++++++++++
16544
148896
+++++++++++++++++

In [113]:
len(nuevo_dataframe)*10 == len(dataframe_final)

False

In [114]:
len(dataframe_final)

181984

In [ ]:
dataframe_final.sample(10)

### Guardo el dataframe_final

In [ ]:
dataframe_final.to_csv('../csv/info_vuelos_final.csv', index = None, header = True)